Version2/TestTool-Fosters/TestTool.Setup/Requests/Events/PullMessages/TC.EV.NVT.02_REQ_04.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/events/wsdl">
  <soap:Body>
    <wsdl:PullMessages>
   <wsdl:PullMessages>
      <wsdl:Timeout>P20S</wsdl:Timeout>
      <wsdl:MessageLimit>2</wsdl:MessageLimit>
      <!--You may enter ANY elements at this point-->
    </wsdl:PullMessages>
  </soap:Body>
</soap:Envelope>