tests/EventPortType_CreatePullPoint.xml

<?xml version='1.0' encoding='UTF-8'?>
            <S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
                <S:Body>
                <ns6:CreatePullPointSubscription xmlns:ns2="http://www.w3.org/2005/08/addressing" 
                    xmlns:ns3="http://docs.oasis-open.org/wsn/b-2" 
                    xmlns:ns4="http://docs.oasis-open.org/wsrf/bf-2" 
                    xmlns:ns5="http://docs.oasis-open.org/wsn/t-1" 
                    xmlns:ns6="http://www.onvif.org/ver10/events/wsdl" 
                    xmlns:ns7="http://www.onvif.org/ver10/schema" 
                    xmlns:xmime="http://www.w3.org/2005/05/xmlmime" 
                    xmlns:ns9="http://www.w3.org/2004/08/xop/include" 
                    xmlns:ns10="http://docs.oasis-open.org/wsrf/r-2">
                    <ns6:Filter>
                        <ns3:TopicExpression xmlns="http://docs.oasis-open.org/wsn/b-2" 
                            xmlns:tns1="http://www.onvif.org/ver10/topics" 
                            Dialect="http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet">
                            tns1:Device
                        </ns3:TopicExpression>
                    </ns6:Filter>
                    <ns3:InitialTerminationTime>PT1M</ns3:InitialTerminationTime>
                </ns6:CreatePullPointSubscription>
                </S:Body>
            </S:Envelope>
