Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/Events/CreatePullPointSubscription/TC.EV.NVT.01_REQ_02.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:tet="http://www.onvif.org/ver10/events/wsdl" xmlns:tns1="http://www.onvif.org/ver10/topics">
  <SOAP-ENV:Body>
    <tet:CreatePullPointSubscription>
      <tet:Filter>
        <wsnt:TopicExpression Dialect="http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet">
         tns1:DoorControl/DoorMode
        </wsnt:TopicExpression>
        <wsnt:MessageContent Dialect="http://www.onvif.org/ver10/tev/messageContentFilter/ItemFilter">
          boolean(//tt:SimpleItem[@Name="tns1:DoorControl/DoorMode"
          and @Value="2"] ) and
          boolean(//tt:SimpleItem[@Name="tns1:DoorControl/DoorMonitor"
          and @Value="1"] )
        </wsnt:MessageContent>
      </tet:Filter>
    </tet:CreatePullPointSubscription>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>