ebook/09.12.01.md

# 9.12.1 GetEventPropertiesRequest

```
<?xml version="1.0" encoding="UTF -8"?> 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"  
		xmlns:wsa="http://www.w3.org/2005/08/addressing"  
		xmlns:tet="http://www.onvif.org/ver10/events/wsdl"> 
	<SOAP-ENV:Header> 
		<wsa:Action> 
			http://www.onvif.org/ver10/events/wsdl/EventPortType/GetEventPropertiesRequest  
		</wsa:Action>  
	</SOAP-ENV:Header> 
	<SOAP-ENV:Body> 
		<tet:GetEventProperties> 
		</tet:GetEventProperties> 
	</SOAP-ENV:Body> 
</SOAP-ENV:Envelope> 
```

[上一章](09.12.md)|[继续阅读](09.12.02.md)